mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
/******************************************************************************
 * Project      : ESP32-CoCo2-Emulator
 * File         : main.cpp
 * Author       : Cedric Beaudoin
 * Created      : 2026-02-23
 *
 * Description  : Main Code
 *
 * Copyright (c) 2026 Cedric Beaudoin
 *
 * Permission is granted for personal, non-commercial use only.
 * Commercial use, distribution, sublicensing, or modification
 * for commercial purposes is strictly prohibited without
 * prior written permission from the author.
 * Please, keep this in the source code.
 * All rights reserved.
 ******************************************************************************/




#include <Arduino.h>
#include "mc6809.hpp"
#include "esp_timer.h"
#include "esp_system.h"

#include "main.h"

#include "ESP32S3vga.h"
#include <GfxWrapper.h>
#include <Fonts/FreeMonoBoldOblique24pt7b.h>
#include <Fonts/FreeSerif24pt7b.h>
#include <Fonts/FreeMono9pt7b.h>



//----------------------------USB STACK-------------------------------------

//#define DEBUG_ALL



//#define DEBUG_PRINT
#include <ESP32-USB-Soft-Host.h>
#include "USB.h"
#define KEY_SHIFT_LEFT




USB_DEVICES_CTRL USB_DEV_CONTROL;



  #define DP_P0  18  // always enabled
  #define DM_P0  17  // always enabled
  #define DP_P1  12
  #define DM_P1  11
  #define DP_P2  16
  #define DM_P2  15
  #define DP_P3  -1
  #define DM_P3  -1

extern USB_DEVICES_CTRL USB_DEV_CONTROL;

extern void Setup_USB(void);





//-----------------------------------------------------------




#define EEPROM_SIZE 2048



uint8_t DEBUGloop1, DEBUGloop2;
void Debug1Toggle(void)
{
  if ((DEBUGloop1 & 0b00000001) == 0)
  {
    GPIO.out_w1ts = (1 << DEBUG1);
  }
  else
  {
    GPIO.out_w1tc = (1 << DEBUG1);
  }
  DEBUGloop1++;
}
void Debug2Toggle(void)
{
  if ((DEBUGloop2 & 0b00000001) == 0)
  {
    GPIO.out_w1ts = (1 << DEBUG2);
  }
  else
  {
    GPIO.out_w1tc = (1 << DEBUG2);
  }
  DEBUGloop2++;
}

void Debug2Hi(void)
{
    GPIO.out_w1ts = (1 << DEBUG2);
}

void Debug2Low(void)
{
    GPIO.out_w1tc = (1 << DEBUG2);
}



uint8_t ResetVectors[16] = {0xA6, 0x81, 0x01, 0x00, 0x01, 0x03, 0x01, 0x0F,
	0x01, 0x0C, 0x01, 0x06, 0x01, 0x09, 0xA0, 0x27};




bool CPU_in_WAIT_STATE = false;



File file;

//#define PSRAM_EMU
#ifndef ISR_CORE
char text_buffer[150];
#endif



uint8_t *MENU_Backup = (uint8_t *)heap_caps_malloc(640*250, MALLOC_CAP_SPIRAM);
uint8_t *MENU_BackupPage2 = (uint8_t *)heap_caps_malloc(640*250, MALLOC_CAP_SPIRAM);
#define DISK_SIZE 161280

uint8_t *RAM_Disk0 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk1 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk2 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
uint8_t *RAM_Disk3 = (uint8_t *)heap_caps_malloc(161280, MALLOC_CAP_SPIRAM);
#ifdef PSRAM_EMU
uint8_t *rom = (uint8_t *)heap_caps_malloc(32769, MALLOC_CAP_SPIRAM);
uint8_t *memory = (uint8_t *)heap_caps_malloc(65536, MALLOC_CAP_SPIRAM);
#else
uint8_t rom[32769];
uint8_t memory[65536];
#endif



SpecialFunctionStruct sf;

struct DiskAccessStruct
{
  uint8_t TrackPos;
  uint8_t DriveSelected;
  uint8_t MotorOnOff;
  uint8_t SectorPos;
  uint8_t DRIVE_COMMAND;
  uint8_t DataRegisterValue;
  uint32_t DSK_FILE_DataPTR;
  bool IsinReadProcess;
  bool IsInWriteProcess;
  bool NMI_Int_Started;
  uint8_t NMI_Delay;    //To Allow the CoCo to read the last byte from the FD502 before the NMI.
  uint16_t RW_Process_ByteRemainingCounter;
};

DiskAccessStruct DiskAccess;


DriveStruct Disk_Drive;



  class cpu_t : public mc6809 
{
  public:
      uint8_t read8(uint16_t address) const 
      {
        uint8_t t_data;
        ManagePeripherals_Read(address);
#ifdef DISK_DEBUG
        DiskDebugRead(address);
#endif
      if (!sf.CoCo2_32K_UPPER_ENABLED)
      {
        if ((address > 0x7fff))
        {

          return rom[address - ROM_OFFSET];
        }
        else
        {
          return memory[address];
        }

      }
      else
      {
        if ((address > 0xdfff))
        {
          
          return rom[address - ROM_OFFSET];
        }
        else
        {
          return memory[address];
        }
      }

        return 0;
      }

      

      void write8(uint16_t address, uint8_t value) const 
      {
          ManagePeripherals_Write(address , value);


        if (!sf.CoCo2_32K_UPPER_ENABLED)
        {
          if (address >0x7fff)
          {
              
              rom[address - 0x8000] = value;
          
          } 
          else
          {
              memory[address] = value;
          }
        }
        else
        {
          if (address >0xdfff)
          {
              
              rom[address - 0x8000] = value;
          
          } 
          else
          {
              memory[address] = value;
          }
        }




          #ifdef DISK_DEBUG
          DiskDebugWrite(address, value);
#endif

          
        }


};



bool ReadCoCoFile(const char* filename, uint8_t DriveNumber)
{
    
    size_t bytesRead;
    File f = SD_MMC.open(filename, FILE_READ);
    if(!f)
    {
#ifdef DEBUG_PRINT    
        Serial.print("Failed to open file: ");
        Serial.println(filename);
#endif
        return false;
    }

    
    switch (DriveNumber)
    {
    case 0:
      bytesRead = f.read(RAM_Disk0, DISK_SIZE);
    break;
    case 1:
      bytesRead = f.read(RAM_Disk1, DISK_SIZE);
    break;
    case 2:
      bytesRead = f.read(RAM_Disk2, DISK_SIZE);
    break;
    case 3:
      bytesRead = f.read(RAM_Disk3, DISK_SIZE);
    break;
    
    default:
      break;
    }
    
    

#ifdef DEBUG_PRINT    
    Serial.print("Read ");
    Serial.print(bytesRead);
    Serial.print(" bytes into RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    f.close();
    

    return true;
}

bool SaveConfigToSD(void) 
{
    File f = SD_MMC.open("/config.ccc", FILE_WRITE);
    if (!f) {
        Serial.println("Failed to open /config.ccc for writing");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t written = f.write(Disk_Drive.Name_Disk[i], 256);
        if (written != 256) 
        {
            Serial.printf("Write failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    f.close();
    Serial.println("Configuration saved to SD");
    return true;
}

bool LoadConfigFromSD(void)
{
    File f = SD_MMC.open("/config.ccc", FILE_READ);
    if (!f) 
    {
        Serial.println("Failed to open /config.ccc for reading");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t readBytes = f.read(Disk_Drive.Name_Disk[i], 256);
        if (readBytes != 256) 
        {
            Serial.printf("Read failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    f.close();
    Serial.println("Configuration loaded from SD");
    return true;
}


bool WriteCoCoFile(const char* filename, uint8_t DriveNumber)
{
    size_t bytesWritten = 0;
    
    
    File f = SD_MMC.open(filename, FILE_WRITE);
    if(!f)
    {
#ifdef DEBUG_PRINT    
      Serial.print("Failed to open file for writing: ");
      Serial.println(filename);
#endif
      return false;
    }

    switch(DriveNumber)
    {
        case 0:
            bytesWritten = f.write(RAM_Disk0, DISK_SIZE);
        break;

        case 1:
            bytesWritten = f.write(RAM_Disk1, DISK_SIZE);
        break;

