mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
        case 2:
            bytesWritten = f.write(RAM_Disk2, DISK_SIZE);
        break;

        case 3:
        bytesWritten = f.write(RAM_Disk3, DISK_SIZE);
        break;

        default:
#ifdef DEBUG_PRINT    
        Serial.println("Invalid DriveNumber");
#endif
        f.close();
        return false;
    }

    f.flush();     // force physical write
    f.close();

#ifdef DEBUG_PRINT    
    Serial.print("Written ");
    Serial.print(bytesWritten);
    Serial.print(" bytes from RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    return (bytesWritten == DISK_SIZE);
}




cpu_t cpu;

void DoCPU(void)
{
  Debug1Toggle();
  
  if (CPU_in_WAIT_STATE)
  {
    if (sf.CPU_HALTED_BY_EMULATOR) //If Emulator is in Menus, 
    {
      return;
    }
    
    if (gpio_get_level(GPIO_NUM_2) != 0)
    {
      return;
    }
    else
    {
      CPU_in_WAIT_STATE = false;
    }
  }
  cpu.execute();
  cpu.execute();

  return;
}

void CopyDiskToRamDisk(void)
{

  ReadCoCoFile((const char*)Disk_Drive.Name_Disk[0], 0);
  ReadCoCoFile((const char*)Disk_Drive.Name_Disk[1], 1);
  ReadCoCoFile((const char*)Disk_Drive.Name_Disk[2], 2);
  ReadCoCoFile((const char*)Disk_Drive.Name_Disk[3], 3);
  
}



    const PinConfig pins(0,0,0,8,9,  0,0,0,6, 7, 0,  0,0,0,4,5,  1,2);
//                             B B X       G  G  X         R  R
    //6 bit mode for Coco 3    0 1 X       0  1  X         0  1

VGA* vga;
GfxWrapper<VGA> *gfx;


Mode mode0 = Mode::MODE_320x240x60;
Mode mode1 = Mode::MODE_320x240x60_4_3;
Mode mode2 = Mode::MODE_640x240x60;
Mode mode3 = Mode::MODE_640x240x60_4_3;




uint8_t SCAN_Keyboard_Matrix[8][7];


uint8_t ReadCoCoButtons(void)
{
  uint8_t val1, val2;
  val1 = USB_DEV_CONTROL.JOY1_BUTT1;
  val2 = USB_DEV_CONTROL.JOY2_BUTT1<<1;

  return val1 | val2;
  
}

void InitSD_Card1(void)
{
  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) 
  {
    Serial.println("Card Mount Failed");
    return;
  }

 file = SD_MMC.open("/GAMES01.DSK", FILE_READ);
  if (!file)
  {
    Serial.println("Failed to open /GAMES01.DSK");
    return;
  }
  else
  {
    Serial.println("File Correct");
  }
  while(1)
  {

  }
}




void InitSD_Card(void)
{

  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) {
    Serial.println("Card Mount Failed");
    return;
  }
  uint8_t cardType = SD_MMC.cardType();
  if(cardType == CARD_NONE){
    Serial.println("No SD_MMC card attached");
    return;
  }

  Serial.print("SD_MMC Card Type: ");
  if(cardType == CARD_MMC){
    Serial.println("MMC");
  } else if(cardType == CARD_SD){
    Serial.println("SDSC");
  } else if(cardType == CARD_SDHC){
    Serial.println("SDHC");
  } else {
    Serial.println("UNKNOWN");
  }

}

#define ROM_OFFSET 0x8000
#define RAM_MODE 0x0000
void InitPeripherals_and_Others(void)
{
  EEPROM.begin(EEPROM_SIZE);

  
  Serial.begin(921600);
  delay(10);
  
  InitSD_Card();
  InitDisks();

  cpu.assign_nmi_line(&sf.nmi_pin);
  cpu.assign_firq_line(&sf.firq_pin);
  cpu.assign_irq_line(&sf.irq_pin);

  
  //------Special registers------
  sf.CPU_HALTED_BY_EMULATOR = false;
  sf.DIRECT_Key_Code = 0;  //Nothing
  sf.PHYSICAL_Drive_Must_Be_Saved = false;
  sf.V_Synch_Int_Enabled = false;
  sf.nmi_pin = true;  //True = disabled
  sf.firq_pin = true; //True = disabled
  sf.irq_pin = true; //True = disabled
  sf.V_Synch = false;
  sf.CoCo2_32K_UPPER_ENABLED = false;
  sf.ROM_Offset = ROM_OFFSET;
  sf.AnyKeypress = false; //Used for Keyboard Scan.
  
  sf.CPU_Speed = CPU_SLOW;
  sf.Coco2VideoGenMODE = 255;    //To reset in first execution
  sf.Coco2VideoPageOffset_Registers = 0b00000010; //Init to be at address 400 (Even if Basic set it at boot)
  sf.Coco2ColorMode = 0;
  sf.VideoEmulatorXpixels = 320;
  sf.Artefact = true; //Artefact mode by default.
  sf.Coco2GraphicMode = 0;

  sf.is_JOY1_B1_WasPressed = false;
  sf.is_JOY1_B2_WasPressed = false;
  sf.is_JOY2_B1_WasPressed = false;
  sf.is_JOY2_B2_WasPressed = false;
  sf.is_LastKeyboardScanned = false;
//------------Init of Disk Registers------

  DiskAccess.IsinReadProcess = false;
  DiskAccess.IsInWriteProcess = false;
  DiskAccess.NMI_Int_Started = false;
  DiskAccess.NMI_Delay = 0;

  ledcSetup (0, 40000, 8);  // PWM Sound Configuration
  ledcAttachPin(47, 0);                   //
  ledcWrite(0,127);


  analogReadResolution(8);

  CopyCoCo2ROMS();
  //CopyCoCo3ROMS();
	
  CopyDiskToRamDisk();
  
  vga = new VGA();
  gfx = new GfxWrapper<VGA>(*vga, mode1.hRes, mode1.vRes);
  vga->bufferCount = 2;
	if(!vga->init(pins, mode1, 8)) while(1) delay(1);
	vga->start();

  SetVideoMode(VIDEO_MODE_320X240_4_3);
  //SetVideoMode(MODE_320x240x60_4_3);
  //SetVideoMode(VIDEO_MODE_320X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_4_3);

}


void SetVideoMode(uint8_t VideoMode)
{
  vga->stop();
  switch (VideoMode)
  {
  case VIDEO_MODE_320X240_16_9:
    sf.VideoEmulatorXpixels = 320;
    if(!vga->Reinit(pins, mode0, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_320X240_4_3:
      sf.VideoEmulatorXpixels = 380;
      if(!vga->Reinit(pins, mode1, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_16_9:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode2, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_4_3:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode3, 8)) while(1) delay(1);
    break;
  
  default:
    break;
  }
  vga->start();

}



const int Field_Synch_Interrupt_PIN = 2;  // VSynch pin


void IRAM_ATTR Field_Synch_Interrupt_Flag() 
{
  /*
    This interrupt is tied to the Vertical Pin of the ESP32
    and is used to update the Field interrupt flag of FF03 bit 7.
    A read of FF02 reset this flag (1 = reset 0 = set)
  
    */

  rom[ROM_FF03] |= 0b10000000;  //Set bit 7

  if (sf.V_Synch_Int_Enabled)
  {
    sf.irq_pin = false;  //Interrupt enabled.
  }
  sf.V_Synch = true;
  //Debug2Toggle();

