mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
}


/*

---------------------------------
FF22:
Resolution Selection
F8 = Pmode 4 256x192 2 colors 11111XXX
E8 = Pmode 3 128x192 4 colors 11101XXX
D8 = pmode 2 128x192 2 colors 11011XXX
C8 = pmode 1 128x96  4 colors 11001XXX
B8 = pmode 0 128x96  2 colors 10111XXX

--SAM CONTROL REGISTERS:




76543210
||||||||_RS232 DATA INPUT
|||||||__SINGLE BIT SOUND OUTPUT
||||||___RAM SIZE INPUT
|||||____VDG CSS -Color set (0 = white, 1 = green)
||||_____VDG GM0
|||______VDG GM1
||_______VDG GM2
|________VDG _A/G

SCREEN X,X 
       | |_____COLOR SET     0 = COLOR SET 1  1 = COLOR SET 2
       |_______DISPLAY MODE  0 = TEXT 1 = GRAPHIC


Mode VDG Settings SAM
                      A/G GM2 GM1 GM0 V2/V1/V0    Desc.   RAM used x,y,clrs in hex(dec)
Internal alphanumeric  0   X   X   0   0  0  0    32x16 ( 5x7 pixel ch)
External alphanumeric  0   X   X   1   0  0  0    32x16 (8x12 pixel ch)
Semigraphic-4          0   X   X   0   0  0  0    32x16 ch, 64x32 pixels
Semigraphic-6          0   X   X   1   0  0  0    64x48 pixels
Full graphic 1-C       1   0   0   0   0  0  1    64x64x4 $400(1024)
Full graphic 1-R       1   0   0   1   0  0  1   128x64x2 $400(1024)
Full graphic 2-C       1   0   1   0   0  1  0   128x64x4 $800(2048)
Full graphic 2-R       1   0   1   1   0  1  1   128x96x2 $600(1536)
Full graphic 3-C       1   1   0   0   1  0  0   128x96x4 $C00(3072)
Full graphic 3-R       1   1   0   1   1  0  1   128x192x2 $C00(3072)
Full graphic 6-C       1   1   1   0   1  1  0   128x192x4 $1800(6144)
Full graphic 6-R       1   1   1   1   1  1  0   256x192x2 $1800(6144)
Direct memory access   X   X   X   X   1  1  1

- The graphic modes with -C are 4 color, -R is 2 color.
- 2 color mode - 8 pixels per byte (each bit denotes on/off)
4 color mode - 4 pixels per byte (each 2 bits denotes color)
- CSS (in FF22) is the color select bit:
Color set 0: 0 = black, 1 = green for -R modes
00 = green, 01 = yellow for -C modes
10 = blue, 11 = red for -C modes
Color set 1: 0 = black, 1 = buff for -R modes


*/

bool IsButtonPressed(void)
{
  if (digitalRead(21) == true)
  {
    return false;
  }
  else
  {
    return true;
  }
}
uint8_t debugloop = 0;

hw_timer_t* cpuTimer = NULL;
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

uint32_t testloop1 = 0;

void IRAM_ATTR onCPUTimer() 
{
  
  Debug1Toggle();
  cpu.execute(); 
  cpu.execute(); 
  testloop1++;
  if (testloop1 == 20000)
  {
    testloop1 = 0;
  }
  
  
}

void setTimerInterval(uint32_t newInterval) //To set Slow/Fast CPU speed
{
  // Disable actual alarm
  timerAlarmDisable(cpuTimer);
  
  // Change timer interval
  timerAlarmWrite(cpuTimer, newInterval, true);  // newInterval est le nombre de ticks
  
  // Réactiver l'alarme
  timerAlarmEnable(cpuTimer);
}

uint8_t ReadJoysticks(uint8_t JoyNum)
{
  

    switch (JoyNum)
  {
  case JOY_RX:
    return USB_DEV_CONTROL.JOY1_X_AXIS;
    break;
  case JOY_RY:
    return USB_DEV_CONTROL.JOY1_Y_AXIS;
    break;
  case JOY_LX:
    return USB_DEV_CONTROL.JOY2_X_AXIS;
    break;
  case JOY_LY:
    return USB_DEV_CONTROL.JOY2_Y_AXIS;
    break;
  
  default:
    break;
  }
  return 255; 
}


//initial setup


void setup()
{
  
  
  pinMode(DEBUG1,OUTPUT);
  pinMode(DEBUG2,OUTPUT);





  InitPeripherals_and_Others();

#define SERIAL1_TX 41
#define SERIAL1_RX 42
#define SERIAL1_BAUD 115200

  Serial1.begin(SERIAL1_BAUD, SERIAL_8N1, SERIAL1_RX, SERIAL1_TX);



  cpu.reset();

  Setup_USB();
  attachInterrupt(digitalPinToInterrupt(Field_Synch_Interrupt_PIN), Field_Synch_Interrupt_Flag, FALLING);


  xTaskCreatePinnedToCore
  (
    VideoCore,        // Fonction
    "SystemCore",      // Name
    6048,              // stack
    NULL,              // Parameter
    2,                 // Priority
    NULL,              // Handle 
    1                  // CPU 0 or 1
  );

}


void loop()
{
  //Nothig to do here, all the work is in ISR and RTOS
}


#define COCO2_GRAPHMODE_32X16_8X12 0b0 //Text 32x16
#define COCO2_GRAPHMODE_256X192X2 0b11110110  //PMODE 4
#define COCO2_GRAPHMODE_128X192X4 0b11100110  //PMODE 3  OK
#define COCO2_GRAPHMODE_128X192X2 0b11010101  //PMODE 2
#define COCO2_GRAPHMODE_128X96X4 0b11000100  //PMODE 1
#define COCO2_GRAPHMODE_128X96X2 0b10110011  //PMODE 0
//---------Other modes in assembly language only, not officialy supported in Basic Coco 2
#define COCO2_GRAPHMODE_128X64X4 0b10100010  //
#define COCO2_GRAPHMODE_128X64X2 0b10010001  //
#define COCO2_GRAPHMODE_64X64X4 0b10000001  //

#define X_OFFSET_32 312
void IRAM_ATTR VideoCore(void *pvParameters) 
{
  uint8_t ModeValue;
  while (true) 
  {
    if (sf.DIRECT_Key_Code == MENU_F12) //Emulator menu entrance
    {
      Serial.println("In Emulator Menu");
      CPU_in_WAIT_STATE = true;
      sf.CPU_HALTED_BY_EMULATOR = true;
      vTaskDelay(1);

      EMULATOR_Menu();
      CPU_in_WAIT_STATE = false;
      sf.CPU_HALTED_BY_EMULATOR = false;
      vTaskDelay(200);
    }
    



    ModeValue = sf.Coco2GraphicMode & 0b11110111;    //Remove the Color bit
    switch (ModeValue)
    {
    
      case COCO2_GRAPHMODE_32X16_8X12:
        Do_COCO2_GRAPHMODE_32X16_8X12();
      break;

      case COCO2_GRAPHMODE_256X192X2:
        if (sf.Artefact)
        {
          Do_COCO2_GRAPHMODE_256X192X2_ARTEFACT();
        }
        else
        {
          Do_COCO2_GRAPHMODE_256X192X2();
        }
      break;

      case COCO2_GRAPHMODE_128X192X4:
        Do_COCO2_GRAPHMODE_128X192X4();
      break;

      case COCO2_GRAPHMODE_128X192X2:
        Do_COCO2_GRAPHMODE_128X192X2();
      break;

      case COCO2_GRAPHMODE_128X96X4:
        Do_COCO2_GRAPHMODE_128X96X4();
      break;

      case COCO2_GRAPHMODE_128X96X2:
        Do_COCO2_GRAPHMODE_128X96X2();
      break;

      case COCO2_GRAPHMODE_128X64X4:
        Do_COCO2_GRAPHMODE_128X64X4();
      break;

      case COCO2_GRAPHMODE_128X64X2:
        Do_COCO2_GRAPHMODE_128X64X2();
    break;

    case COCO2_GRAPHMODE_64X64X4:
      Do_COCO2_GRAPHMODE_64X64X4();
break;

      
      
      default:
      break;
    }

    
    
