mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
      vga->dot(Xloop+4,Yloop1, Color[Dot1bit[5]]);
      vga->dot(Xloop+5,Yloop1, Color[Dot1bit[5]]);

      vga->dot(Xloop+6,Yloop1, Color[Dot1bit[4]]);
      vga->dot(Xloop+7,Yloop1, Color[Dot1bit[4]]);

      vga->dot(Xloop+8,Yloop1, Color[Dot1bit[3]]);
      vga->dot(Xloop+9,Yloop1, Color[Dot1bit[3]]);

      vga->dot(Xloop+10,Yloop1, Color[Dot1bit[2]]);
      vga->dot(Xloop+11,Yloop1, Color[Dot1bit[2]]);

      vga->dot(Xloop+12,Yloop1, Color[Dot1bit[1]]);
      vga->dot(Xloop+13,Yloop1, Color[Dot1bit[1]]);

      vga->dot(Xloop+14,Yloop1, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop1, Color[Dot1bit[0]]);

    
    
    }
  }




}


void Do_COCO2_GRAPHMODE_128X96X4(void)
{


  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_128X96X4)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_128X96X4;
  }




  uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  
  if ((sf.Coco2GraphicMode & 0b00001000) == 0)
  {
    Color[0] = 0b00011100;  //Green
    Color[1] = 0b11111100;  //Yellow
    Color[2] = 0b00000011;  //Blue
    Color[3] = 0b11100000;  //Red
  }
  else
  {
    Color[0] = 0xff; //blanc
    Color[1] = 0b01011011;  //Turquoise
    Color[2] = 0b11100011;  //lilas
    Color[3] = 0b11101000;  //orange(buff)
  }  

  for (Yloop = 24; Yloop <216; Yloop+=2)
  {
    for (Xloop = 32; Xloop <288 ; Xloop+=8)
    {

      Dot1bit[3] = (memory[MemLoop] >> 6) & 0b11;  // Bits 6-7
      Dot1bit[2] = (memory[MemLoop] >> 4) & 0b11;  // Bits 4-5
      Dot1bit[1] = (memory[MemLoop] >> 2) & 0b11;  // Bits 2-3
      Dot1bit[0] = (memory[MemLoop++] >> 0) & 0b11;  // Bits 0-1

      //Line one
      vga->dot(Xloop,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+2,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+6,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[0]]);

      //Line 2

      vga->dot(Xloop,Yloop+1, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop+1, Color[Dot1bit[3]]);

      vga->dot(Xloop+2,Yloop+1, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop+1, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop+1, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop+1, Color[Dot1bit[1]]);

      vga->dot(Xloop+6,Yloop+1, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop+1, Color[Dot1bit[0]]);

      
    }
  }

}


void Do_COCO2_GRAPHMODE_128X192X2(void)   
{

  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_128X192X2)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_128X192X2;
  }



  uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[2];

  if ((sf.Coco2GraphicMode & 0b00001000) == 0)
  {
    Color[0] = 0b00000000;  //black
    Color[1] = 0b00011100; //green
  }
  else
  {
    Color[0] = 0x00;
    Color[1] = 0xff;
  }  

  for (Yloop = 24; Yloop <216; Yloop++)
  {
    for (Xloop = (sf.VideoEmulatorXpixels-256)>>1; Xloop <sf.VideoEmulatorXpixels - ((sf.VideoEmulatorXpixels-256)>>1) ; Xloop+=16)
    {
      Dot1bit[7] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[6] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[5] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[4] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[3] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[2] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[1] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[0] = (memory[MemLoop++] & 0b00000001);
      
      vga->dot(Xloop,Yloop, Color[Dot1bit[7]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[7]]);

      vga->dot(Xloop+2,Yloop, Color[Dot1bit[6]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[6]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[5]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[5]]);

      vga->dot(Xloop+6,Yloop, Color[Dot1bit[4]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[4]]);

      vga->dot(Xloop+8,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+9,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+10,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+11,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+12,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+13,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+14,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop, Color[Dot1bit[0]]);
      
    }
  }
}

void Do_COCO2_GRAPHMODE_128X192X4(void)
{
  

  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_128X192X4)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_128X192X4;
    Serial.println("MODE");
  }

  uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  
  if ((sf.Coco2GraphicMode & 0b00001000) == 0)
  {
    Color[0] = 0b00011100;  //Green
    Color[1] = 0b11111100;  //Yellow
    Color[2] = 0b00000011;  //Blue
    Color[3] = 0b11100000;  //Red
  }
  else
  {
    Color[0] = 0xff; //blanc
    Color[1] = 0b01011011;  //Turquoise
    Color[2] = 0b11100011;  //lilas
    Color[3] = 0b11101000;  //orange(buff)
  }  



  for (Yloop = 24; Yloop <216; Yloop++)
  {
    for (Xloop = 32; Xloop < 288 ; Xloop+=8)
    {
      Dot1bit[3] = (memory[MemLoop] >> 6) & 0b11;  // Bits 6-7
      Dot1bit[2] = (memory[MemLoop] >> 4) & 0b11;  // Bits 4-5
      Dot1bit[1] = (memory[MemLoop] >> 2) & 0b11;  // Bits 2-3
      Dot1bit[0] = (memory[MemLoop++] >> 0) & 0b11;  // Bits 0-1
      
      vga->dot(Xloop,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+2,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[1]]);

