mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
      vga->dot(Xloop+6,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[0]]);
  
  
    }
  }

}

void Do_COCO2_GRAPHMODE_256X192X2(void)
{
  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_256X192X2)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();
    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_256X192X2;
  }

  uint32_t MemLoop = (sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN);
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[16];
  uint8_t Color[2];

  if ((sf.Coco2GraphicMode & 0b00001000) == 0)
  {
    Color[0] = 0b00000000;  //black
    Color[1] = 0b00011100; //green
  }
  else
  {
    Color[0] = 0x00;
    Color[1] = 0xff;
  }  

  for (Yloop = 23; Yloop <216; Yloop++)

  {
    for (Xloop = 32; Xloop <288 ; Xloop+=16)
    {
      
      Dot1bit[0] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[1] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[2] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[3] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[4] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[5] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[6] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[7] = (memory[MemLoop++] & 0b00000001);

      Dot1bit[7] = Color[Dot1bit[7]];
      Dot1bit[6] = Color[Dot1bit[6]];
      Dot1bit[5] = Color[Dot1bit[5]];
      Dot1bit[4] = Color[Dot1bit[4]];
      Dot1bit[3] = Color[Dot1bit[3]];
      Dot1bit[2] = Color[Dot1bit[2]];
      Dot1bit[1] = Color[Dot1bit[1]];
      Dot1bit[0] = Color[Dot1bit[0]];

      Dot1bit[8] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[9] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[10] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[11] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[12] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[13] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[14] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[15] = (memory[MemLoop++] & 0b00000001);

      Dot1bit[15] = Color[Dot1bit[15]];
      Dot1bit[14] = Color[Dot1bit[14]];
      Dot1bit[13] = Color[Dot1bit[13]];
      Dot1bit[12] = Color[Dot1bit[12]];
      Dot1bit[11] = Color[Dot1bit[11]];
      Dot1bit[10] = Color[Dot1bit[10]];
      Dot1bit[9] = Color[Dot1bit[9]];
      Dot1bit[8] = Color[Dot1bit[8]];


      vga->drawLineFromMemory16(Xloop, Yloop,&Dot1bit[0]);

    }
  }
}

void IRAM_ATTR Do_COCO2_GRAPHMODE_256X192X2_ARTEFACT(void) 
{
  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_256X192X2)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();
    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_256X192X2;
    
  }
  uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  uint16_t DotCount = 0;
  uint16_t Xcount;
  uint8_t BitCount;
  bool NoBlackFlag = false;
  Color[0] = 0b00000000;  // Black
  Color[2] = 0b11100000;  // Red
  Color[1] = 0b00000011;  // blue
  Color[3] = 0b11111111;  // White
  uint8_t LinePrep[266];
  uint16_t LinePrepLoop;
  for (Yloop = 24; Yloop <216; Yloop++)
  {
    Xcount = 0;
    DotCount = 0;
    LinePrepLoop = 0;

    for (Xloop = 32; Xloop <288 ; Xloop+=8)
    {
      Dot1bit[0] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[1] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[2] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[3] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[4] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[5] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[6] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[7] = (memory[MemLoop++] & 0b00000001);
      
      //---The following 8 ittération used without loop for optimisation.  
      //   With FOR LOOP 0 to 7, ther is not enough time to fill the video page before the Vsynch occur
      //   --All the optimisations are validated with an oscilloscope and does the job quite well.
      BitCount = 0;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }
        

      BitCount = 1;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 2;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 3;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

