mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
      BitCount = 4;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 5;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 6;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 7;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }



      //--------------------------------------
      LinePrepLoop+=8;
    }
    vga->drawLineFromMemory256(32, Yloop,&LinePrep[0]);
  }
}


void Do_COCO2_GRAPHMODE_256X192X2_ARTEFACT_BACK(void) //(almost)
{
     vga->clear(0b11111111);
    uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
    uint16_t Xloop, Yloop;
    uint8_t Dot1bit[8];
    uint8_t Color[4];

    // Définition des couleurs artefact NTSC
    Color[0] = 0b00000000;  // noir
    Color[1] = 0b11100000;  // rouge
    Color[2] = 0b00000011;  // bleu
    Color[3] = 0b11111111;  // blanc

    for (Yloop = 24; Yloop < 216; Yloop++)
    {
        for (Xloop = (sf.VideoEmulatorXpixels - X_OFFSET_32) >> 1; 
             Xloop < sf.VideoEmulatorXpixels - ((sf.VideoEmulatorXpixels - X_OFFSET_32) >> 1); 
             Xloop += 8)
        {
            uint8_t byte = memory[MemLoop++];
            
            // 8 Bit decoding for this line
            for (int i = 0; i < 8; i += 2)
            {
                // Group pixels in pairs for artefacts NTSC
                uint8_t pair = (byte >> (6 - i)) & 0b11;
                vga->dot(Xloop + i, Yloop, Color[pair]);
                vga->dot(Xloop + i + 1, Yloop, Color[pair]);
            }
        }
    }
}




void Do_COCO2_GRAPHMODE_32X16_8X12(void)
{
  if (sf.Coco2VideoGenMODE != COCO2_GRAPHMODE_32X16_8X12)
  {
    vga->clear(0b00000000);
    vga->show();
    vga->clear(0b00000000);
    vga->show();
    sf.Coco2VideoGenMODE = COCO2_GRAPHMODE_32X16_8X12;
  }
  gfx->fillRect(((sf.VideoEmulatorXpixels-X_OFFSET_32)>>1),24-1,256,192,VDG_GREEN);
  gfx->setTextColor(0);
  uint32_t MemLoop = sf.Coco2VideoPageOffset_Registers * COCO2_GRAPH_OFFSET_LEN;
  uint8_t tmpchar;
  for (uint8_t Yloop = 0; Yloop !=16; Yloop++)
  {
    for (uint8_t Xloop = 0; Xloop != 32; Xloop++)
    {
      tmpchar = memory[MemLoop++];
      DisplayVDGchar(tmpchar,Xloop*8+ ((sf.VideoEmulatorXpixels-X_OFFSET_32)>>1), Yloop*12+23);
    }
  }
}




