mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
void CopyCoCo2ROMS(void)
{
  uint32_t LoopRomSource, LoopRam1;

  // Copy extbas11 to 0x8000 (8K)
  LoopRam1 = 0x8000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
    memory[LoopRam1++] = extbas11[LoopRomSource];

  // Copy bas12 to 0xA000 (8K)
  LoopRam1 = 0xA000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
  memory[LoopRam1++] = bas13[LoopRomSource];


  // Copy disk11 to 0xC000 (8K)
  LoopRam1 = 0xC000;
  for (LoopRomSource = 0; LoopRomSource < 8192; LoopRomSource++)
    memory[LoopRam1++] = disk11[LoopRomSource];

  // copy memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
  LoopRomSource = 0;
  for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
  {
    rom[LoopRomSource++] = memory[LoopRam1];
  }
  // Reset vectors
  
  uint32_t VectorsLoop = 0;
  LoopRomSource = 0xfff0 - 0x8000;
  for (VectorsLoop = 0; VectorsLoop !=16 ; VectorsLoop++)
  {
    memory[LoopRomSource + 0x8000] = ResetVectors[VectorsLoop];
    rom[LoopRomSource++] = ResetVectors[VectorsLoop];
  }
}




void CopyCoCo3ROMS(void)
{
  uint32_t LoopRom1, LoopRam1, LoopRomSource;

  LoopRam1 = 0x8000;  //coco3p
  for (LoopRom1 = 0; LoopRom1 != 8192 * 3; LoopRom1++)
  {
    memory[LoopRam1++] = coco3[LoopRom1];
  }

  LoopRam1 = 0xc000;  //disk11
  for (LoopRom1 = 0; LoopRom1 != 8192; LoopRom1++)
  {
    memory[LoopRam1++] = disk11[LoopRom1];
  }

 
    // Copy de memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
    LoopRomSource = 0;
    for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
    {
      rom[LoopRomSource++] = memory[LoopRam1];
    }

    
 
  return;
}


  #define M_FF22 0xff22

  //Disk access
  #define M_FF40 0xff40
  #define M_FF48 0xff48
  #define M_FF49 0xff49
  #define M_FF4A 0xff4a
  #define M_FF4B 0xff4b

  #define M_FFC0 0xffc0
  #define M_FFC1 0xffc1
  #define M_FFC2 0xffc2
  #define M_FFC3 0xffc3
  #define M_FFC4 0xffc4
  #define M_FFC5 0xffc5
  #define M_FFC6 0xffc6
  #define M_FFC7 0xffc7
  #define M_FFC8 0xffc8
  #define M_FFC9 0xffc9
  #define M_FFCA 0xffca
  #define M_FFCB 0xffcb
  #define M_FFCC 0xffcc
  #define M_FFCD 0xffcd
  #define M_FFCE 0xffce
  #define M_FFCF 0xffcf
  #define M_FFD0 0xffd0
  #define M_FFD1 0xffd1
  #define M_FFD2 0xffd2
  #define M_FFD3 0xffd3
  #define M_FFD4 0xffd4
  #define M_FFD5 0xffd5
  #define M_FFDE 0xffde //ROM 32K
  #define M_FFDF 0xffdf //RAM 32K UPPER
  
  
  
  #define ROM_FF22 0xff22 - ROM_OFFSET  
/*
DRQ = 1 when the Computer can read data or write data to the register.
DRQ is 0 when is busy.
*/

#define MACRO_TRACK_R DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define MACRO_TRACK_W DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define M_DRQ_BIT_READY 0b00000010
  
  
  
void ManagePeripherals_Read(uint16_t address)
{
  
  
  if (DiskAccess.NMI_Delay >0)
  {
    DiskAccess.NMI_Delay--;
    if (DiskAccess.NMI_Delay==2)
    {
      sf.nmi_pin = false;  //NMI Started
    }

    if (DiskAccess.NMI_Delay == 1)
    {
      sf.nmi_pin = true;  //NMI Stopped

    }


  }


  //Manage all the read operation of memory addresses
  switch (address)
  {
    case M_FF02: //ROM_FF02:
      rom[ROM_FF03] &= 0b01111111;  //If ff02 Address is read, it reset the Vsynch interrupt flag AT ff03.
      if (sf.V_Synch_Int_Enabled)
      {
        sf.irq_pin = true;  //Interrupt Disabled.
      }
      sf.V_Synch = false; 

      break;
      //All next are drive related--------------------------

      
    case M_FF00: //ROM_FF02:

    uint8_t val1, buttons, tmp1;
    uint8_t MultiplexerCB2_CA2;
    if (true)  
    {
      ManageKeyboardScan(rom[ROM_FF02]);
      //Do the joystick stuff first
      buttons = ReadCoCoButtons();
      
      if ((buttons & 0b00000001) == 0)
      {
        //Serial.print("JO");
        sf.is_JOY1_B1_WasPressed=true;
        rom[ROM_FF00] &=0b11111110;
      }
      else
      {

        if (!sf.is_LastKeyboardScanned)
        {
          rom[ROM_FF00] |=0b00000001;
        }
        else
        {
          sf.is_LastKeyboardScanned = false;
        }
      }

      if ((buttons & 0b00000010) == 0)
      {
        
        rom[ROM_FF00] &=0b11111101;
      }
      
      
    
      MultiplexerCB2_CA2 = (((rom[ROM_FF03] & 0b00001000)>>2) | ((rom[ROM_FF01] & 0b00001000)>>3));   //Get the two bits Comparator Selection
      val1 = ReadJoysticks(MultiplexerCB2_CA2);   //Sample Requested joystick
      
      if (val1 > (rom[ROM_FF20] & 0b11111100))
      {
        rom[ROM_FF00] |= 0b10000000;

      }
      else
      {
        rom[ROM_FF00] &= 0b01111111;

      }

    }
    else //Manage Keyboard
    {
      uint8_t val1;
      ManageKeyboardScan(rom[ROM_FF02]);
    }

    

      break;


    case M_FF48: 

      if (DiskAccess.IsinReadProcess)   //If Disk Access transaction;
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Will step the ASM routine to read the next Byte
      }
      else
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Always no error
      }

    break;    //error here, this is why the next block works
    case  M_FF4B:
      
    if (DiskAccess.IsinReadProcess)
    {
      
      DiskAccess.DriveSelected = GetDriveNumber(rom[ROM_FF40]);
      if (DiskAccess.DriveSelected != Disk_Drive.LastNumber_Accessed)
      {
        Disk_Drive.LastNumber_Accessed = DiskAccess.DriveSelected;
        if (Disk_Drive.isFileAlreadyOpen)
        {
          //file.close(); //Close the actual
        }


        Disk_Drive.isFileAlreadyOpen = true;
      }
      rom[ROM_FF4B] = ReadDiskByte(DiskAccess.DSK_FILE_DataPTR);  //RAM_Disk[DiskAccess.DSK_FILE_DataPTR++];
      DiskAccess.DSK_FILE_DataPTR++;
      DiskAccess.RW_Process_ByteRemainingCounter--;
      if (DiskAccess.RW_Process_ByteRemainingCounter==0)
      {
        rom[ROM_FF48] = 0;
        DiskAccess.IsinReadProcess = false;
        DiskAccess.NMI_Delay = 4;
        sf.nmi_pin = false;  //NMI Started
        
      }
    }
    else
    {
      Disk_Drive.isFileAlreadyOpen = false;
      //file.close();  //Close the actual
      Disk_Drive.LastNumber_Accessed = 254;
    }
    break;


    default:
    break;
  }
  //return rom[address-0xff40];
}


uint8_t ReadDiskByte(uint32_t BytePos)
{
  uint8_t ByteRead;
  switch (DiskAccess.DriveSelected)
  {
  case 0:
  ByteRead = RAM_Disk0[BytePos];
  break;
  case 1:
  ByteRead = RAM_Disk1[BytePos];
  break;
  case 2:
  ByteRead = RAM_Disk2[BytePos];
  break;
  case 3:
  ByteRead = RAM_Disk3[BytePos];
  break;
  
  default:
    break;
  }
  return ByteRead;
}

void WriteDiskByte(uint32_t BytePos, uint8_t ByteData)
{

  switch (DiskAccess.DriveSelected)
  {
  case 0:
    RAM_Disk0[BytePos] = ByteData;
  break;
  case 1:
    RAM_Disk1[BytePos] = ByteData;
  break;
  case 2:
    RAM_Disk2[BytePos] = ByteData;
  break;
  case 3:
    RAM_Disk3[BytePos] = ByteData;
  break;
  
  default:
    break;
  }


