mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
}


uint8_t MountFileSystem(void)
{
  if (!SD_MMC.begin())
    return 2; // No Card / init fail

  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE)
    return 3; // No media

  return 0;
}

uint8_t GetDriveNumber(uint8_t Address)
{
  uint8_t tmpDrive = 0;
  if (Address & 0b00000001)
  {
    tmpDrive = 0;
  }
  else if (Address & 0b00000010)
  {
    tmpDrive = 1;
  }
  else if (Address & 0b00000100)
  {
    tmpDrive = 2;
  }
  else if (Address & 0b01000000)
  {
    tmpDrive = 3;
  }
  return tmpDrive;  
}


void InitDisks(void)
{
  
  LoadConfigFromSD();

  Disk_Drive.Name_Disk[0][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[1][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[2][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[3][255] = 0; //Just to be sure.

  Disk_Drive.LastNumber_Accessed = 255; //No Last Accessed
  Disk_Drive.isFileAlreadyOpen = false;

  Disk_Drive.Error = false;
  Disk_Drive.LastAccessType = 255;

  return;
}



  void DebugTrack(void)
  {
    Serial.print("T: ");
    Serial.print(rom[ROM_FF49]);
    Serial.print("  S: ");
    Serial.print(rom[ROM_FF4A]);
    Serial.print(" SF T:");
    Serial.print(DiskAccess.TrackPos);
    Serial.print(" SF S:");
    Serial.print(DiskAccess.SectorPos);
    Serial.print(" Data Pointer: ");
    Serial.print(DiskAccess.DSK_FILE_DataPTR);

    Serial.print(" PC: ");
    Serial.println(cpu.get_pc(),HEX);


    delay(40);
  }


  void ManagePeripherals_Write(uint16_t address, uint8_t value)
  {


    uint8_t tmpvar8t;
    uint16_t tmpvar16t;

    if (DiskAccess.NMI_Delay >0)
    {
      DiskAccess.NMI_Delay--;
      if (DiskAccess.NMI_Delay==2)
      {
        sf.nmi_pin = false;  //NMI Started

        rom[ROM_FF48] = 0;
      }

      if (DiskAccess.NMI_Delay == 1)
      {
        sf.nmi_pin = true;  //NMI Stopped
      }

    }




    switch (address)
    {
      case M_FF20:
        rom[ROM_FF20] = value;
        if ((rom[ROM_FF23] & 0b00001000)!=0)  //So, Sound is enabled
        {
          ledcWrite(0,value);
        }
      break;
    case M_FF02:
        ManageKeyboardScan(value);
        rom[ROM_FF02] = value;
      break;
    case M_FF03:
        if ((value & 0b00000001) == 0)
        {
          sf.V_Synch_Int_Enabled = false;
        }
        else
        {
          sf.V_Synch_Int_Enabled = true;
        }  
      break;

      case M_FFD9:
        sf.CPU_Speed = CPU_FAST;
      break;
      case M_FFD8:
        sf.CPU_Speed = CPU_SLOW;
      break;
//----------------Disk Related---------------
   case M_FF40:
    rom[ROM_FF40] = value;
    
    break;


#define DSKCMD_RESTORE 0x03
#define DSKCMD_SEEK 0x10
#define DSKCMD_STEP 0x20
#define DSKCMD_STEP_IN 0x40
#define DSKCMD_STEP_OUT 0x50
#define DSKCMD_READ_SECTOR 0x80
#define DSKCMD_WRITE_SECTOR 0xa0
#define DSKCMD_READ_ADDRESS 0xc0
#define DSKCMD_READ_TRACK 0xe0
#define DSKCMD_WRITE_TRACK 0xf0
#define DSKCMD_FORCE_INT 0xd0


    case M_FF48:
      if (value > 0b00001111)
      {
        value &=0b11110000;
      }
    
      rom[ROM_FF48] = value;
      #ifdef DEBUG_ALL
      Serial.print("Track Number:");
      Serial.println(rom[ROM_FF49]);
      #endif
      DiskAccess.DRIVE_COMMAND = value;
      switch (value)
      {
        case DSKCMD_STEP:

        while(1)
        {
          //sleep(100);
        }    


        case DSKCMD_SEEK:
        rom[ROM_FF48] = 0;
        rom[ROM_FF49] = rom[ROM_FF4B];    //New Rom track is in Data register
        DiskAccess.TrackPos = rom[ROM_FF49];
        DiskAccess.SectorPos = rom[ROM_FF4A];
        break;
      case DSKCMD_RESTORE:
        DiskAccess.TrackPos = 0;
        DiskAccess.SectorPos = 0;
        rom[ROM_FF49] = 0;  //Track position 0
        rom[ROM_FF4A] = 0;  //Sector position 0
        rom[ROM_FF48] = 0;  //Always OK
        break;
      case DSKCMD_READ_SECTOR:
        DiskAccess.IsinReadProcess = true;
        DiskAccess.RW_Process_ByteRemainingCounter = 257; //Init the loop counter for data to be transfered;
        DiskAccess.TrackPos = rom[ROM_FF49];
        MACRO_TRACK_R;
        rom[ROM_FF48] = 0;  //Reset the bit
        
        break;
      
      case DSKCMD_STEP_IN:
        rom[ROM_FF49]+=1; 
        DiskAccess.TrackPos +=1;
        break;
      case DSKCMD_STEP_OUT:
        rom[ROM_FF49]-=1; 
        DiskAccess.TrackPos -=1;
        break;
      case DSKCMD_WRITE_SECTOR:
        DiskAccess.IsInWriteProcess = true;
        DiskAccess.RW_Process_ByteRemainingCounter = 257; //Init the loop counter for data to be transfered;
        DiskAccess.TrackPos = rom[ROM_FF49];
        MACRO_TRACK_W;
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Reset the bit
        break;
      default:
        break;
      }
    break;
    case M_FF49:
      rom[ROM_FF49] = value;
      DiskAccess.TrackPos = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
      break;

    case M_FF4A:
      rom[ROM_FF4A] = value;
      DiskAccess.SectorPos = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
    break;



  case  M_FF4B:
    rom[ROM_FF4B] = value;
    if (DiskAccess.IsInWriteProcess)
    {
      if (DiskAccess.RW_Process_ByteRemainingCounter<258)   //Skip the first write (Not valid)
      {
        if (DiskAccess.DriveSelected != Disk_Drive.LastNumber_Accessed)
        {
          Disk_Drive.LastNumber_Accessed = DiskAccess.DriveSelected;
          if (Disk_Drive.isFileAlreadyOpen)
          {
            //file.close(); //Close the actual
          }
          Disk_Drive.isFileAlreadyOpen = true;
        }

        WriteDiskByte(DiskAccess.DSK_FILE_DataPTR, rom[ROM_FF4B]);
        DiskAccess.DSK_FILE_DataPTR++;
        rom[ROM_FF48] = M_DRQ_BIT_READY;
      }
      else
      {
      }
      DiskAccess.RW_Process_ByteRemainingCounter--;

      if (DiskAccess.RW_Process_ByteRemainingCounter==1)
      {
        DiskAccess.RW_Process_ByteRemainingCounter = 0;
        //file.flush(); 
        
        sf.PHYSICAL_Drive_Must_Be_Saved = true; //Flag to request a File save (can't do it in Fotwrare Interrupt)
        rom[ROM_FF48] = M_DRQ_BIT_READY;

