mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
        DiskAccess.IsInWriteProcess = false;
        DiskAccess.NMI_Delay = 4;
        sf.nmi_pin = false;  //NMI Started
        Disk_Drive.isFileAlreadyOpen = false;

        Disk_Drive.LastNumber_Accessed = 254;
        
      }
    }
    else
    {
      Disk_Drive.isFileAlreadyOpen = false; //ADDED

      Disk_Drive.LastNumber_Accessed = 254; //ADDED
      
      
      rom[ROM_FF4B] = value;
      DiskAccess.DataRegisterValue = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
    }
    break;


//------------All the next logic is for videomodes---------------------
    case M_FF22:
      rom[ROM_FF22] = value;
      //sf.Coco2GraphicMode &= (0b00000111);  //Keep the V2 V1 V0
      //sf.Coco2GraphicMode |= (value & 0b11111000); //Read the VDG values only.
      
      sf.Coco2GraphicMode = (sf.Coco2GraphicMode & 0b00000111) | (value & 0b11111000);      
      
      break;


      //In the next decode, no need to store data at address because it's only set reset.  Address are not readables
    case M_FFC0:
      sf.Coco2GraphicMode &=0b11111110;
    break;
    case M_FFC1:
      sf.Coco2GraphicMode |=0b00000001;
    break;
    case M_FFC2:
      sf.Coco2GraphicMode &=0b11111101;
    break;
    case M_FFC3:
      sf.Coco2GraphicMode |=0b00000010;
    break;

    case M_FFC4:
      sf.Coco2GraphicMode &=0b11111011;
    break;
    case M_FFC5:
      sf.Coco2GraphicMode |=0b00000100;
    break;
    //--------------------Next are Address offset SET/RESET registers--------------------
    case M_FFC6:
      sf.Coco2VideoPageOffset_Registers &=0b11111110; //Clear the bit
    break;
    case M_FFC7:
    sf.Coco2VideoPageOffset_Registers |=0b00000001; //Set the bit
    break;
    case M_FFC8:
      sf.Coco2VideoPageOffset_Registers &=0b11111101; //Clear the bit
    break;
    case M_FFC9:
    sf.Coco2VideoPageOffset_Registers |=0b00000010; //Set the bit
    break;
    case M_FFCA:
      sf.Coco2VideoPageOffset_Registers &=0b11111011; //Clear the bit
    break;
    case M_FFCB:
    sf.Coco2VideoPageOffset_Registers |=0b00000100; //Set the bit
    break;
    case M_FFCC:
      sf.Coco2VideoPageOffset_Registers &=0b11110111; //Clear the bit
    break;
    case M_FFCD:
    sf.Coco2VideoPageOffset_Registers |=0b00001000; //Set the bit
    break;
    case M_FFCE:
      sf.Coco2VideoPageOffset_Registers &=0b11101111; //Clear the bit
    break;
    case M_FFCF:
    sf.Coco2VideoPageOffset_Registers |=0b00010000; //Set the bit
    break;
    case M_FFD0:
      sf.Coco2VideoPageOffset_Registers &=0b11011111; //Clear the bit
    break;
    case M_FFD1:
    sf.Coco2VideoPageOffset_Registers |=0b00100000; //Set the bit
    break;
    case M_FFD2:
      sf.Coco2VideoPageOffset_Registers &=0b10111111; //Clear the bit
    break;
    case M_FFD3:
    sf.Coco2VideoPageOffset_Registers |=0b01000000; //Set the bit
    break;

    case M_FFDE:
      sf.CoCo2_32K_UPPER_ENABLED = false;
    break;
    case M_FFDF:
      sf.CoCo2_32K_UPPER_ENABLED = true;
    break;




      default:
      break;
    }

  }

void FillKeyboardMatrix(void)
{
  for (int loop1 = 0; loop1 != 8; loop1++)
  {
    for (int loop2 = 0; loop2 != 7; loop2++)
    {
      SCAN_Keyboard_Matrix[loop1][loop2] = 0;
    }
  }
  sf.AnyKeypress = false; 
  
  for (uint8_t loop1 = 0; loop1 !=8; loop1++)
  {
    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b01000000)
    SCAN_Keyboard_Matrix[loop1][6] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b01000000) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00100000)
        SCAN_Keyboard_Matrix[loop1][5] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00100000) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00010000)
        SCAN_Keyboard_Matrix[loop1][4] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00010000) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00001000)
        SCAN_Keyboard_Matrix[loop1][3] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00001000) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000100)
        SCAN_Keyboard_Matrix[loop1][2] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000100) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000010)
        SCAN_Keyboard_Matrix[loop1][1] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000010) ^ 0b01111111);

    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000001)
        SCAN_Keyboard_Matrix[loop1][0] = ((USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] & 0b00000001) ^ 0b01111111);
    if (USB_DEV_CONTROL.USB_CoCo_Key_Array[loop1] != 0)
    {
      sf.AnyKeypress = true; 
    }
  }


}
  
  
  void ManageKeyboardScan(uint8_t value)
  {
    uint8_t loop1, loop2, Val1;
    bool ValDone = false;

    Val1 = value ^ 0b11111111;
    rom[ROM_FF00] |= 0b01111111;   //Reset to nothing to scan.
    
    if (ReadCoCoButtons()==3 && !sf.is_JOY1_B1_WasPressed) //All buttons released and was not pressed
    {
      sf.is_LastKeyboardScanned = true;
      
      if ((Val1 & 0b10000000) != 0 && ValDone == false) //case 0b01111111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[7][loop1] != 0)
          {

            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[7][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b01000000) != 0 && ValDone == false) //case 0b10111111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[6][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[6][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00100000) != 0 && ValDone == false) //case 0b11011111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[5][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[5][loop1];
            ValDone = true;
          }
        }
      }
        
      if ((Val1 & 0b00010000) != 0 && ValDone == false) //case 0b11101111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[4][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[4][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00001000) != 0 && ValDone == false) //case 0b11110111
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[3][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[3][loop1];
            ValDone = true;
          }
        }
      } 
      
