mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
      if ((Val1 & 0b00000100) != 0 && ValDone == false) //case 0b11111011
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[2][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[2][loop1];
            ValDone = true;
          }
        }
      }

      if ((Val1 & 0b00000010) != 0 && ValDone == false) //case 0b11111101
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[1][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[1][loop1];
            ValDone = true;
          }
        }
      }
        
      if ((Val1 & 0b00000001) != 0 && ValDone == false) //case 0b11111110
      {
        for (loop1 = 0; loop1 !=7; loop1++)  //Scan the collumn for active keypress
        {
          if (SCAN_Keyboard_Matrix[0][loop1] != 0)
          {
            rom[ROM_FF00] &= SCAN_Keyboard_Matrix[0][loop1];
            ValDone = true;
          }
        }
      }

      
    }
    else
    {

      sf.is_JOY1_B1_WasPressed=false;
      rom[ROM_FF00] &= 0x7f;
    }
  }


  //--------------------------------VDG MAP----------------------------------------------------------
  


  void DisplayVDGchar(uint8_t charNum, uint16_t Xpos, uint16_t Ypos)
  {
    uint32_t loop1, loop2;
    uint16_t XposLoop, YposLoop;
    loop1 = charNum * 8 * 12;
    for (YposLoop = Ypos; YposLoop != Ypos+12; YposLoop++)
    {
      vga->drawLineFromMemory8(Xpos, YposLoop,&cc2_VDG_MAP[loop1]);
      loop1+=8;
    }
  }

void line(int x0, int y0, int x1, int y1, int rgb)
{
    int dx = abs(x1 - x0);
    int sx = x0 < x1 ? 1 : -1;

    int dy = -abs(y1 - y0);
    int sy = y0 < y1 ? 1 : -1;

    int err = dx + dy; 

    while (true)
    {
        vga->dot(x0, y0, rgb); 

        if (x0 == x1 && y0 == y1)
            break;

        int e2 = 2 * err;
        if (e2 >= dy)
        {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx)
        {
            err += dx;
            y0 += sy;
        }
    }
}


  //---------------------------------------USB STACK FOR COCO KEYBOARD MAPPING AND JOYSTICKS-----------------------




static void my_USB_DetectCB( uint8_t usbNum, void * dev )
{
  sDevDesc *device = (sDevDesc*)dev;
#ifdef DEBUG_PRINT  
  printf("New device detected on USB#%d\n", usbNum);
  printf("desc.bcdUSB             = 0x%04x\n", device->bcdUSB);
  printf("desc.bDeviceClass       = 0x%02x\n", device->bDeviceClass);
  printf("desc.bDeviceSubClass    = 0x%02x\n", device->bDeviceSubClass);
  printf("desc.bDeviceProtocol    = 0x%02x\n", device->bDeviceProtocol);
  printf("desc.bMaxPacketSize0    = 0x%02x\n", device->bMaxPacketSize0);
  printf("desc.idVendor           = 0x%04x\n", device->idVendor);
  printf("desc.idProduct          = 0x%04x\n", device->idProduct);
  printf("desc.bcdDevice          = 0x%04x\n", device->bcdDevice);
  printf("desc.iManufacturer      = 0x%02x\n", device->iManufacturer);
  printf("desc.iProduct           = 0x%02x\n", device->iProduct);
  printf("desc.iSerialNumber      = 0x%02x\n", device->iSerialNumber);
  printf("desc.bNumConfigurations = 0x%02x\n", device->bNumConfigurations);
#endif
  // if( device->iProduct == mySupportedIdProduct && device->iManufacturer == mySupportedManufacturer ) {
  //   myListenUSBPort = usbNum;
  // }
}


static void my_USB_PrintCB(uint8_t usbNum, uint8_t byte_depth, uint8_t* data, uint8_t data_len)
{
  // if( myListenUSBPort != usbNum ) return;
  if (usbNum == USB_DEV_CONTROL.PORT_KEYBOARD)
  {
    UpdateKeyMap(data);
  }
  else if (usbNum == USB_DEV_CONTROL.PORT_JOY1)
  {
    UpdateJoyMap(data, usbNum);
  }
  else if (usbNum == USB_DEV_CONTROL.PORT_JOY2)
  {
    UpdateJoyMap(data, usbNum);
  }
  
  #ifdef DEBUG_ALL
  printf(" in: ");
  for(int k=0;k<data_len;k++) {
    printf("0x%02x ", data[k] );
  }
  printf("\n");
#endif

  }

usb_pins_config_t USB_Pins_Config =
{
  DP_P0, DM_P0,
  DP_P1, DM_P1,
  DP_P2, DM_P2,
  DP_P3, DM_P3
};

void Setup_USB(void)
{
    fillKeysStruct();
  
    USH.setOnConfigDescCB( Default_USB_ConfigDescCB );
    USH.setOnIfaceDescCb( Default_USB_IfaceDescCb );
    USH.setOnHIDDevDescCb( Default_USB_HIDDevDescCb );
    USH.setOnEPDescCb( Default_USB_EPDescCb );

    USH.init( USB_Pins_Config, my_USB_DetectCB, my_USB_PrintCB );


}

#define K_ESC 27
#define K_F1 1
#define K_F2 2
#define K_BACKSPACE 8
#define K_APOSTROPHE 39
#define K_ENTER 13
#define K_QUOTE 34
#define K_SPACE 32
#define K_CLEAR 3
#define K_SHIFT 0x82
#define K_CTRL 0x81
#define K_ALT 0x84
#define K_CAPS 0x0a  //SHIFT 0 on CoCo

#define K_UP 4
#define K_DOWN 5
#define K_LEFT 6
#define K_RIGHT 7


#define lookupOR_0 0b00000001
#define lookupOR_1 0b00000010
#define lookupOR_2 0b00000100
#define lookupOR_3 0b00001000
#define lookupOR_4 0b00010000
#define lookupOR_5 0b00100000
#define lookupOR_6 0b01000000
#define lookupOR_7 0b10000000

#define lookupAND_0 0b11111110
#define lookupAND_1 0b11111101
#define lookupAND_2 0b11111011
#define lookupAND_3 0b11110111
#define lookupAND_4 0b11101111
#define lookupAND_5 0b11011111
#define lookupAND_6 0b10111111
#define lookupAND_7 0b01111111
void fillKeysStruct(void)
{
    USB_DEV_CONTROL.JOY1_BUTT1 = 1;
    USB_DEV_CONTROL.JOY1_BUTT2 = 1;
    USB_DEV_CONTROL.JOY1_X_AXIS = 31;
    USB_DEV_CONTROL.JOY1_Y_AXIS = 31;
    USB_DEV_CONTROL.JOY2_BUTT1 = 1;
    USB_DEV_CONTROL.JOY2_BUTT2 = 1;
    USB_DEV_CONTROL.JOY2_X_AXIS = 31;
    USB_DEV_CONTROL.JOY2_Y_AXIS = 31;

    
    USB_DEV_CONTROL.PORT_JOY1 = 1;
    USB_DEV_CONTROL.PORT_JOY2 = 2;
    USB_DEV_CONTROL.PORT_KEYBOARD = 0;
    for (uint16_t u=0; u!=256; u++)
    {
        USB_DEV_CONTROL.ScanArray[u] = 0;
    }


    USB_DEV_CONTROL.ScanArray[0x29] = K_ESC;
    USB_DEV_CONTROL.ScanArray[0x3a] = K_F1;
    USB_DEV_CONTROL.ScanArray[0x3b] = K_F2;
    USB_DEV_CONTROL.ScanArray[0x1e] = '1';
    USB_DEV_CONTROL.ScanArray[0x1f] = '2';
    USB_DEV_CONTROL.ScanArray[0x20] = '3';
    USB_DEV_CONTROL.ScanArray[0x21] = '4';
    USB_DEV_CONTROL.ScanArray[0x22] = '5';
    USB_DEV_CONTROL.ScanArray[0x23] = '6';
    USB_DEV_CONTROL.ScanArray[0x24] = '7';
    USB_DEV_CONTROL.ScanArray[0x25] = '8';
    USB_DEV_CONTROL.ScanArray[0x26] = '9';
    USB_DEV_CONTROL.ScanArray[0x27] = '0';
    USB_DEV_CONTROL.ScanArray[0x2d] = '-';
    USB_DEV_CONTROL.ScanArray[0x2e] = '=';
    USB_DEV_CONTROL.ScanArray[0x2a] = K_BACKSPACE;
    USB_DEV_CONTROL.ScanArray[0x14] = 'Q';
    USB_DEV_CONTROL.ScanArray[0x1a] = 'W';
    USB_DEV_CONTROL.ScanArray[0x08] = 'E';
    USB_DEV_CONTROL.ScanArray[0x15] = 'R';
    USB_DEV_CONTROL.ScanArray[0x17] = 'T';
    USB_DEV_CONTROL.ScanArray[0x1c] = 'Y';
    USB_DEV_CONTROL.ScanArray[0x18] = 'U';
    USB_DEV_CONTROL.ScanArray[0x0c] = 'I';
    USB_DEV_CONTROL.ScanArray[0x12] = 'O';
    USB_DEV_CONTROL.ScanArray[0x13] = 'P';
    USB_DEV_CONTROL.ScanArray[0x04] = 'A';
    USB_DEV_CONTROL.ScanArray[0x16] = 'S';
    USB_DEV_CONTROL.ScanArray[0x07] = 'D';
    USB_DEV_CONTROL.ScanArray[0x09] = 'F';
    USB_DEV_CONTROL.ScanArray[0x0a] = 'G';
    USB_DEV_CONTROL.ScanArray[0x0b] = 'H';
    USB_DEV_CONTROL.ScanArray[0x0d] = 'J';
    USB_DEV_CONTROL.ScanArray[0x0e] = 'K';
    USB_DEV_CONTROL.ScanArray[0x0f] = 'L';
    USB_DEV_CONTROL.ScanArray[0x33] = ';';
    USB_DEV_CONTROL.ScanArray[0x34] = K_APOSTROPHE;
    USB_DEV_CONTROL.ScanArray[0x28] = K_ENTER;
    USB_DEV_CONTROL.ScanArray[0x1d] = 'Z';
    USB_DEV_CONTROL.ScanArray[0x1b] = 'X';
    USB_DEV_CONTROL.ScanArray[0x06] = 'C';
    USB_DEV_CONTROL.ScanArray[0x19] = 'V';
    USB_DEV_CONTROL.ScanArray[0x05] = 'B';
    USB_DEV_CONTROL.ScanArray[0x11] = 'N';
    USB_DEV_CONTROL.ScanArray[0x10] = 'M';
    USB_DEV_CONTROL.ScanArray[0x36] = ',';
    USB_DEV_CONTROL.ScanArray[0x37] = '.';
    USB_DEV_CONTROL.ScanArray[0x38] = '/';
    USB_DEV_CONTROL.ScanArray[0x39] = K_CAPS;  //SHIFT 0 on CoCo

