mast4rbug/ESP32_CoCo2_Emulator/src/main.cpp
    USB_DEV_CONTROL.ScanArray[0x52] = K_UP;
    USB_DEV_CONTROL.ScanArray[0x51] = K_DOWN;
    USB_DEV_CONTROL.ScanArray[0x50] = K_LEFT;
    USB_DEV_CONTROL.ScanArray[0x4f] = K_RIGHT;


    USB_DEV_CONTROL.ScanArray[0x80 | 0x1e] = '!';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x1f] = '@';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x20] = '#';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x21] = '$';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x22] = '%';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x23] = '^';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x24] = '&';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x25] = '*';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x26] = '(';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x27] = ')';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x2d] = '_';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x2e] = '+';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x34] = K_QUOTE;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x33] = ':';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x36] = '<';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x37] = '>';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x38] = '?';
    USB_DEV_CONTROL.ScanArray[0x2c] = K_SPACE;
    USB_DEV_CONTROL.ScanArray[0x4c] = K_CLEAR;

    USB_DEV_CONTROL.ScanArray[0x80 | 0x82] = K_SHIFT;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x81] = K_CTRL;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x84] = K_ALT;



}



void UpdateKeyMap(uint8_t * Data)
{
    bool ShiftDisabled = false;
    bool ForceShift = false;
    uint8_t SpecialKey;
    uint8_t KeyTranslated = 0;
    uint8_t loop1;
    SpecialKey = (((Data[0] >> 4) | (Data[0] & 0x0f)) | 0x80);
    for (uint8_t u = 0; u!=8; u++)
    {
        USB_DEV_CONTROL.USB_CoCo_Key_Array[u] = 0;
    }
    

    

    //Special keys case
    if (SpecialKey !=0) //If Special key and no key press
    {
        switch (SpecialKey)
        {
        case K_SHIFT:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_6;
            
            break;
        case K_CTRL:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_6;
            break;
        case K_ALT:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_6;
            break;
        default:
            break;
        }
    }
    
    sf.DIRECT_Key_Code = Data[2];
    
    for (loop1=2; loop1 !=7; loop1++)
    {
        KeyTranslated = Data[loop1];
        if (SpecialKey == K_SHIFT)
        {
            KeyTranslated = (KeyTranslated | 0b10000000);
        }
        
        KeyTranslated = USB_DEV_CONTROL.ScanArray[KeyTranslated];
        
        
        
        switch (KeyTranslated)
        {
        case 'H':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_1;
            break;
        case 'P':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_2;
            break;
        case 'X':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_3;
            break;
        case '0':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_4;
            break;
        case '8':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_5;
            break;
        case K_ENTER:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_6;
            break;
        //-------------------------------------------
        case 'A':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_0;
            break;
        case 'I':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_1;
            break;
        case 'Q':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_2;
            break;
        case 'Y':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_3;
            break;
        case '1':
        case '!':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_4;
            break;
        case '9':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_5;
            break;
        case K_CLEAR:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_6;
            break;
        //-------------------------------------------
        case 'B':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_0;
            break;
        case 'J':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_1;
            break;
        case 'R':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_2;
            break;
        case 'Z':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_3;
            break;
        case '2':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_4;
            break;
        case K_ESC:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_6;
            break;
        //-------------------------------------------
        case 'C':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_0;
            break;
        case 'K':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_1;
            break;
        case 'S':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_2;
            break;
        case K_UP:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_3;
            break;
        case '3':
        case '#':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_4;
            break;
        case ';':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_5;
            break;
        //-------------------------------------------
        case 'D':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_0;
            break;
        case 'L':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_1;
            break;
        case 'T':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_2;
            break;
        case K_DOWN:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_3;
            break;
        case '4':
        case '$':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_4;
            break;
        case ',':
        case '<':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[4] |= lookupOR_5;
            break;
        //-------------------------------------------
        case 'E':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_0;
            break;
        case 'M':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_1;
            break;
        case 'U':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_2;
            break;
        case K_LEFT:
        case K_BACKSPACE:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_3;
            break;
        case '5':
        case '%':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_4;
            break;
        case '-':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_5;
            break;
        case K_F1:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_6;
            break;
        //-------------------------------------------
        case 'F':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_0;
            break;
        case 'N':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_1;
            break;
        case 'V':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_2;
            break;
        case K_RIGHT:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_3;
            break;
        case '6':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_4;
            break;
        case '.':
        case '>':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_5;
            break;
        case K_F2:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_6;
            break;
        //-------------------------------------------
        case 'G':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_0;
            break;
        case 'O':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_1;
            break;
        case 'W':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_2;
            break;
        case K_SPACE:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_3;
            break;
        case '7':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_4;
            break;
        case '/':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_5;
            break;
        case '&':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[6] |= lookupOR_4;
            break;
        case '?':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_5;
            break;
        case '@':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_0;
            ShiftDisabled = true;
            break;
        case '*':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_5;
            break;
        case '(':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_5;
            break;
        case ')':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[1] |= lookupOR_5;
            break;
        case '=':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[5] |= lookupOR_5;
            ForceShift = true;
            break;
        case '+':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[3] |= lookupOR_5;
            ForceShift = true;
            break;
        case K_CAPS:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[0] |= lookupOR_4;
            ForceShift = true;
            break;
        case ':':
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_5;
            ShiftDisabled = true;
            break;
        case K_APOSTROPHE:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[7] |= lookupOR_4;
            ForceShift = true;
            break;
        case K_QUOTE:
            USB_DEV_CONTROL.USB_CoCo_Key_Array[2] |= lookupOR_4;
            ForceShift = true;
            break;

        


